Revit 2024 API
StructuralConnectionCodeCheckingStatus Enumeration
 An enumerated type listing all code checking status of the structural connection element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Since: 2017
Syntax
C#
public enum StructuralConnectionCodeCheckingStatus
Visual Basic
Public Enumeration StructuralConnectionCodeCheckingStatus
Visual C++
public enum class StructuralConnectionCodeCheckingStatus
Members
Member name | Description
NotCalculated |  Status not calculated.
OkChecked |  Status OK checked.
CheckingFailed |  Status checking failed.
See Also
Autodesk.Revit.DB.Structure Namespace